# Напишите функцию, которая считает количество цифр в числе^

def num(x):
    quantity = len(str(x))
    return quantity


print(num(x=3456))
