# Показать на экран таблицу умножения в диапазоне, указанном
# пользователем. Например, если пользователь указал 3 и 5, таблица
# может выглядеть так
# 3*1 = 3 3*2 = 6 3*3 = 9 ... 3 * 10 = 30
# .....................................................................................
# 5*1 = 5 5 *2 = 10 5 *3 = 15 ... 5 * 10 = 50

# 1. Вводим нужный диапазон:
first_number = int(input('Введите начало диапазона: '))
second_number = int(input('Введите конец диапазона: '))

start = min(first_number, second_number)
end = max(first_number, second_number)

for i in range(start, end + 1):
    print(f"\n {i}:", end="\t")
    for j in range(1, 11):
        result = i * j
        print(f"{i} × {j} = {result}", end="\t")
